const 相交集 = {
  三相交: {
    子图宽度: 220,
    定位: '75,72',
    原始集合: [
      {
        内容宽度: 56,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 56,
        标签文本行数: 3,
        标签文本位置: '141,271',
        标签文本定位: 'topCenter',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '39,194',
        箭头文本定位: 'middleRight',
        箭头文本对齐: '居中',
        箭头连线位置: '86,196,56,196',
      },
      {
        内容宽度: 56,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 56,
        标签文本行数: 3,
        标签文本位置: '225,270',
        标签文本定位: 'topCenter',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '325,195',
        箭头文本定位: 'middleLeft',
        箭头文本对齐: '居中',
        箭头连线位置: '284,196,314,196',
      },
      {
        内容宽度: 100,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 56,
        标签文本行数: 3,
        标签文本位置: '186,58',
        标签文本定位: 'bottomCenter',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '250,45',
        箭头文本定位: 'bottomCenter',
        箭头文本对齐: '居中',
        箭头连线位置: '250,116,250,48',
      },
    ],
    衍生集合: [
      {
        内容宽度: 50,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 50,
        标签文本行数: 3,
        标签文本位置: '0,0',
        标签文本定位: 'topLeft',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '146,63',
        箭头文本定位: 'topLeft',
        箭头文本对齐: '居中',
        箭头连线位置: '146,63,246,163',
      },
      {
        内容宽度: 50,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 50,
        标签文本行数: 3,
        标签文本位置: '0,0',
        标签文本定位: 'topLeft',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '70,42',
        箭头文本定位: 'topLeft',
        箭头文本对齐: '居中',
        箭头连线位置: '70,42,170,142',
      },
      {
        内容宽度: 50,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 50,
        标签文本行数: 3,
        标签文本位置: '0,0',
        标签文本定位: 'topLeft',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '97,186',
        箭头文本定位: 'topLeft',
        箭头文本对齐: '居中',
        箭头连线位置: '97,186,197,286',
      },
      {
        内容宽度: 50,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 50,
        标签文本行数: 3,
        标签文本位置: '0,0',
        标签文本定位: 'topLeft',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '30,299',
        箭头文本定位: 'topLeft',
        箭头文本对齐: '居中',
        箭头连线位置: '160,184,49,295',
      },
      {
        内容宽度: 50,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 36,
        标签文本行数: 3,
        标签文本位置: '0,0',
        标签文本定位: 'topLeft',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '340,301',
        箭头文本定位: 'topRight',
        箭头文本对齐: '右',
        箭头连线位置: '215,209,303,297',
      },
      {
        内容宽度: 50,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 50,
        标签文本行数: 3,
        标签文本位置: '0,0',
        标签文本定位: 'topLeft',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '119,94',
        箭头文本定位: 'bottomRight',
        箭头文本对齐: '右',
        箭头连线位置: '120,139,85,104',
      },
      {
        内容宽度: 50,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 50,
        标签文本行数: 3,
        标签文本位置: '0,0',
        标签文本定位: 'topLeft',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 2,
        箭头文本位置: '262,103',
        箭头文本定位: 'bottomLeft',
        箭头文本对齐: '左',
        箭头连线位置: '253,147,288,112',
      },
    ],
  },
  二相交: {
    子图宽度: 220,
    定位: '77,41',
    原始集合: [
      {
        内容宽度: 50,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 50,
        标签文本行数: 3,
        标签文本位置: '235,23',
        标签文本定位: 'bottomCenter',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '37,101',
        箭头文本定位: 'middleRight',
        箭头文本对齐: '居中',
        箭头连线位置: '85,101,47,101',
      },
      {
        内容宽度: 50,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 50,
        标签文本行数: 3,
        标签文本位置: '148,24',
        标签文本定位: 'bottomCenter',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '336,102',
        箭头文本定位: 'middleLeft',
        箭头文本对齐: '居中',
        箭头连线位置: '285,101,324,101',
      },
    ],
    衍生集合: [
      {
        内容宽度: 20,
        内容文本行数: 3,
        内容文本对齐: '居中',
        标签宽度: 100,
        标签文本行数: 3,
        标签文本位置: '0,0',
        标签文本定位: 'topLeft',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '185,195',
        箭头文本定位: 'topCenter',
        箭头文本对齐: '居中',
        箭头连线位置: '186,137,186,190',
      },
    ],
  },
  全集: {
    三相交: {
      字体大小: 12,
      相交集: {
        子图宽度: 220,
        定位: '78,139',
        原始集合: [
          {
            内容宽度: 56,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 56,
            标签文本行数: 3,
            标签文本位置: '142,345',
            标签文本定位: 'topCenter',
            标签文本对齐: '居中',
            箭头宽度: 100,
            箭头文本行数: 3,
            箭头文本位置: '30,259',
            箭头文本定位: 'middleRight',
            箭头文本对齐: '居中',
            箭头连线位置: '85,259,36,259',
          },
          {
            内容宽度: 56,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 90,
            标签文本行数: 2,
            标签文本位置: '223,344',
            标签文本定位: 'topCenter',
            标签文本对齐: '居中',
            箭头宽度: 100,
            箭头文本行数: 3,
            箭头文本位置: '343,259',
            箭头文本定位: 'middleLeft',
            箭头文本对齐: '居中',
            箭头连线位置: '292,260,340,260',
          },
          {
            内容宽度: 100,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 90,
            标签文本行数: 2,
            标签文本位置: '189,111',
            标签文本定位: 'bottomCenter',
            标签文本对齐: '居中',
            箭头宽度: 100,
            箭头文本行数: 2,
            箭头文本位置: '237,58',
            箭头文本定位: 'bottomCenter',
            箭头文本对齐: '居中',
            箭头连线位置: '238,177,238,64',
          },
        ],
        衍生集合: [
          {
            内容宽度: 50,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 50,
            标签文本行数: 3,
            标签文本位置: '0,0',
            标签文本定位: 'topLeft',
            标签文本对齐: '居中',
            箭头宽度: 100,
            箭头文本行数: 3,
            箭头文本位置: '0,0',
            箭头文本定位: 'topLeft',
            箭头文本对齐: '居中',
            箭头连线位置: '0,0,100,100',
          },
          {
            内容宽度: 50,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 50,
            标签文本行数: 3,
            标签文本位置: '0,0',
            标签文本定位: 'topLeft',
            标签文本对齐: '居中',
            箭头宽度: 100,
            箭头文本行数: 3,
            箭头文本位置: '0,0',
            箭头文本定位: 'topLeft',
            箭头文本对齐: '居中',
            箭头连线位置: '0,0,100,100',
          },
          {
            内容宽度: 50,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 50,
            标签文本行数: 3,
            标签文本位置: '0,0',
            标签文本定位: 'topLeft',
            标签文本对齐: '居中',
            箭头宽度: 100,
            箭头文本行数: 3,
            箭头文本位置: '0,0',
            箭头文本定位: 'topLeft',
            箭头文本对齐: '居中',
            箭头连线位置: '0,0,100,100',
          },
          {
            内容宽度: 50,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 50,
            标签文本行数: 3,
            标签文本位置: '0,0',
            标签文本定位: 'topLeft',
            标签文本对齐: '居中',
            箭头宽度: 154,
            箭头文本行数: 2,
            箭头文本位置: '23,371',
            箭头文本定位: 'topLeft',
            箭头文本对齐: '左',
            箭头连线位置: '161,247,41,367',
          },
          {
            内容宽度: 50,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 36,
            标签文本行数: 3,
            标签文本位置: '0,0',
            标签文本定位: 'topLeft',
            标签文本对齐: '居中',
            箭头宽度: 154,
            箭头文本行数: 2,
            箭头文本位置: '348,370',
            箭头文本定位: 'topRight',
            箭头文本对齐: '右',
            箭头连线位置: '211,280,299,368',
          },
          {
            内容宽度: 50,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 50,
            标签文本行数: 3,
            标签文本位置: '0,0',
            标签文本定位: 'topLeft',
            标签文本对齐: '居中',
            箭头宽度: 100,
            箭头文本行数: 2,
            箭头文本位置: '20,112',
            箭头文本定位: 'bottomLeft',
            箭头文本对齐: '居中',
            箭头连线位置: '123,210,36,124',
          },
          {
            内容宽度: 50,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 50,
            标签文本行数: 3,
            标签文本位置: '0,0',
            标签文本定位: 'topLeft',
            标签文本对齐: '居中',
            箭头宽度: 100,
            箭头文本行数: 2,
            箭头文本位置: '351,112',
            箭头文本定位: 'bottomRight',
            箭头文本对齐: '居中',
            箭头连线位置: '252,219,347,123',
          },
        ],
      },
      全集: {
        位置尺寸: '48,124,280,210',
        内容宽度: 50,
        内容文本行数: 3,
        内容文本位置: '64,138',
        内容文本对齐: '居中',
        标签宽度: 100,
        标签文本行数: 1,
        标签文本位置: '134,38',
        标签文本定位: 'bottomCenter',
        标签文本对齐: '居中',
        箭头宽度: 100,
        箭头文本行数: 3,
        箭头文本位置: '0,0',
        箭头文本定位: 'topLeft',
        箭头文本对齐: '居中',
        箭头连线位置: '0,0,100,100',
      },
    },
    二相交: {
      字体大小: 12,
      相交集: {
        子图宽度: 220,
        定位: '79,134',
        原始集合: [
          {
            内容宽度: 50,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 50,
            标签文本行数: 3,
            标签文本位置: '229,280',
            标签文本定位: 'topCenter',
            标签文本对齐: '居中',
            箭头宽度: 100,
            箭头文本行数: 3,
            箭头文本位置: '26,194',
            箭头文本定位: 'middleRight',
            箭头文本对齐: '居中',
            箭头连线位置: '83,193,34,193',
          },
          {
            内容宽度: 50,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 50,
            标签文本行数: 3,
            标签文本位置: '127,280',
            标签文本定位: 'topCenter',
            标签文本对齐: '居中',
            箭头宽度: 100,
            箭头文本行数: 3,
            箭头文本位置: '347,193',
            箭头文本定位: 'middleLeft',
            箭头文本对齐: '居中',
            箭头连线位置: '291,193,339,193',
          },
        ],
        衍生集合: [
          {
            内容宽度: 20,
            内容文本行数: 3,
            内容文本对齐: '居中',
            标签宽度: 100,
            标签文本行数: 3,
            标签文本位置: '0,0',
            标签文本定位: 'topLeft',
            标签文本对齐: '居中',
            箭头宽度: 100,
            箭头文本行数: 3,
            箭头文本位置: '186,301',
            箭头文本定位: 'topCenter',
            箭头文本对齐: '居中',
            箭头连线位置: '187,234,187,287',
          },
        ],
      },
      全集: {
        位置尺寸: '46,60,280,210',
        内容宽度: 50,
        内容文本行数: 3,
        内容文本位置: '53,70',
        内容文本对齐: '居中',
        标签宽度: 100,
        标签文本行数: 2,
        标签文本位置: '50,46',
        标签文本定位: 'bottomLeft',
        标签文本对齐: '左',
        箭头宽度: 100,
        箭头文本行数: 1,
        箭头文本位置: '187,32',
        箭头文本定位: 'bottomCenter',
        箭头文本对齐: '居中',
        箭头连线位置: '187,68,187,42',
      },
    },
  },
};

// 由于很难实现自动布局，包含集关于渲染的参数设置有点复杂，暂时没想到其它更好的办法
const 包含集 = {
  框架布局: {
    子图宽度: 220,
    定位: '77,22',
  },
  一层包含: {
    单子集: {
      横向: {
        原始集合: [
          {
            内容宽度: 80,
            内容文本行数: 6,
          },
          {
            内容宽度: 60,
            内容文本行数: 4,
          },
        ],
      },
      纵向: {
        原始集合: [
          {
            内容宽度: 120,
            内容文本行数: 4,
          },
          {
            内容宽度: 80,
            内容文本行数: 4,
          },
        ],
      },
    },
    双子集: {
      子集相交: {
        横向: {
          原始集合: [
            {
              内容宽度: 100,
              内容文本行数: 2,
            },
            {
              内容宽度: 50,
              内容文本行数: 4,
            },
            {
              内容宽度: 50,
              内容文本行数: 4,
            },
          ],
          衍生集合: [
            {
              内容宽度: 40,
              内容文本行数: 3,
            },
          ],
        },
        纵向: {
          原始集合: [
            {
              内容宽度: 50,
              内容文本行数: 5,
            },
            {
              内容宽度: 80,
              内容文本行数: 2,
            },
            {
              内容宽度: 80,
              内容文本行数: 2,
            },
          ],
          衍生集合: [
            {
              内容宽度: 60,
              内容文本行数: 2,
            },
          ],
        },
      },
      子集分离: {
        横向: {
          原始集合: [
            {
              内容宽度: 120,
              内容文本行数: 3,
            },
            {
              内容宽度: 50,
              内容文本行数: 3,
            },
            {
              内容宽度: 50,
              内容文本行数: 3,
            },
          ],
        },
        纵向: {
          原始集合: [
            {
              内容宽度: 50,
              内容文本行数: 6,
            },
            {
              内容宽度: 50,
              内容文本行数: 4,
            },
            {
              内容宽度: 50,
              内容文本行数: 4,
            },
          ],
        },
      },
    },
  },
  二层包含: {
    横向: {
      原始集合: [
        {
          内容宽度: 40,
          内容文本行数: 4,
        },
        {
          内容宽度: 40,
          内容文本行数: 3,
        },
        {
          内容宽度: 80,
          内容文本行数: 4,
        },
      ],
    },
    纵向: {
      原始集合: [
        {
          内容宽度: 100,
          内容文本行数: 2,
        },
        {
          内容宽度: 80,
          内容文本行数: 2,
        },
        {
          内容宽度: 80,
          内容文本行数: 4,
        },
      ],
    },
  },
  三层包含: {
    横向: {
      原始集合: [
        {
          内容宽度: 40,
          内容文本行数: 4,
        },
        {
          内容宽度: 30,
          内容文本行数: 4,
        },
        {
          内容宽度: 20,
          内容文本行数: 3,
        },
        {
          内容宽度: 60,
          内容文本行数: 3,
        },
      ],
    },
    纵向: {
      原始集合: [
        {
          内容宽度: 100,
          内容文本行数: 2,
        },
        {
          内容宽度: 80,
          内容文本行数: 2,
        },
        {
          内容宽度: 60,
          内容文本行数: 1,
        },
        {
          内容宽度: 60,
          内容文本行数: 3,
        },
      ],
    },
  },
  全集: {
    包含集: [
      {
        子图宽度: 220,
        定位: '77,60',
      },
    ],
    全集: {
      位置尺寸: '45,19,280,260',
      内容宽度: 50,
      内容文本行数: 3,
      内容文本位置: '0,0',
      标签宽度: 50,
      标签文本行数: 3,
      标签文本位置: '0,0',
      箭头文本位置: '0,0',
      箭头连线位置: '0,0,100,100',
    },
  },
  两个包含集: {
    // 定义名称时注意不要与类方法相同，否则会产生冲突
    // 布局: {
    框架布局: {
      字体大小: 12,
      包含集: [
        {
          子图宽度: 126,
          定位: '58,82',
        },
        {
          子图宽度: 126,
          定位: '193,83',
        },
      ],
    },
    一层包含: {
      单子集: {
        横向: {
          原始集合: [
            {
              内容宽度: 60,
              内容文本行数: 3,
            },
            {
              内容宽度: 40,
              内容文本行数: 3,
            },
          ],
        },
        纵向: {
          原始集合: [
            {
              内容宽度: 60,
              内容文本行数: 3,
            },
            {
              内容宽度: 40,
              内容文本行数: 3,
            },
          ],
        },
      },
      双子集: {
        子集相交: {
          横向: {
            原始集合: [
              {
                内容宽度: 75,
                内容文本行数: 1,
              },
              {
                内容宽度: 40,
                内容文本行数: 2,
              },
              {
                内容宽度: 40,
                内容文本行数: 2,
              },
            ],
            衍生集合: [
              {
                内容宽度: 30,
                内容文本行数: 2,
              },
            ],
          },
          纵向: {
            原始集合: [
              {
                内容宽度: 20,
                内容文本行数: 4,
              },
              {
                内容宽度: 50,
                内容文本行数: 2,
              },
              {
                内容宽度: 50,
                内容文本行数: 2,
              },
            ],
            衍生集合: [
              {
                内容宽度: 50,
                内容文本行数: 1,
              },
            ],
          },
        },
        子集分离: {
          横向: {
            原始集合: [
              {
                内容宽度: 80,
                内容文本行数: 1,
              },
              {
                内容宽度: 40,
                内容文本行数: 2,
              },
              {
                内容宽度: 40,
                内容文本行数: 2,
              },
            ],
            衍生集合: [
              {
                内容宽度: 50,
                内容文本行数: 3,
              },
            ],
          },
          纵向: {
            原始集合: [
              {
                内容宽度: 30,
                内容文本行数: 4,
              },
              {
                内容宽度: 40,
                内容文本行数: 2,
              },
              {
                内容宽度: 40,
                内容文本行数: 2,
              },
            ],
            衍生集合: [
              {
                内容宽度: 50,
                内容文本行数: 3,
              },
            ],
          },
        },
      },
    },
    二层包含: {
      横向: {
        原始集合: [
          {
            内容宽度: 20,
            内容文本行数: 4,
          },
          {
            内容宽度: 20,
            内容文本行数: 3,
          },
          {
            内容宽度: 50,
            内容文本行数: 3,
          },
        ],
      },
      纵向: {
        子图宽度: 126,
        定位: '193,104',
        原始集合: [
          {
            内容宽度: 60,
            内容文本行数: 1,
          },
          {
            内容宽度: 50,
            内容文本行数: 1,
          },
          {
            内容宽度: 50,
            内容文本行数: 3,
          },
        ],
      },
    },
    三层包含: { 横向: {}, 纵向: {} },
  },
};

const 离散集 = {
  单集: {
    定位: '76,19',
    子图宽度: 300,
  },
  多集: {
    定位: '57,21',
    子图宽度: 280,
  },
};
export { 相交集, 包含集, 离散集 };
