export default {
  包含集: {
    框架布局: {
      子图宽度: 220,
      定位: '77,22',
    },
    一层包含: {
      单子集: {
        横向: {
          原始集合: [
            {
              填充颜色: 'none',
              内容布局: {
                宽度: 80,
                文本行数: 6,
              },
            },
            {
              填充颜色: 'rgba(81, 160, 255, 0.65)',
              内容布局: {
                宽度: 60,
                文本行数: 4,
              },
            },
          ],
        },
        纵向: {
          原始集合: [
            {
              填充颜色: 'none',
              内容布局: {
                宽度: 120,
                文本行数: 4,
              },
            },
            {
              填充颜色: 'rgba(81, 160, 255, 0.65)',
              内容布局: {
                宽度: 80,
                文本行数: 4,
              },
            },
          ],
        },
      },
      双子集: {
        子集相交: {
          横向: {
            子图宽度: 220,
            定位: '77,22',
            原始集合: [
              {
                填充颜色: 'none',
                内容布局: {
                  宽度: 100,
                  文本行数: 2,
                },
              },
              {
                填充颜色: 'rgba(81, 160, 255, 0.15)',
                内容布局: {
                  宽度: 50,
                  文本行数: 4,
                },
              },
              {
                填充颜色: 'rgba(81, 160, 255, 0.15)',
                内容布局: {
                  宽度: 50,
                  文本行数: 4,
                },
              },
            ],
            衍生集合: [
              {
                填充颜色: 'rgba(81, 160, 255, 0.35)',
                内容布局: {
                  宽度: 40,
                  文本行数: 3,
                },
              },
            ],
          },
          纵向: {
            原始集合: [
              {
                填充颜色: 'none',
                内容布局: {
                  宽度: 50,
                  文本行数: 5,
                },
              },
              {
                填充颜色: 'rgba(81, 160, 255, 0.15)',
                内容布局: {
                  宽度: 80,
                  文本行数: 2,
                },
              },
              {
                填充颜色: 'rgba(81, 160, 255, 0.15)',
                内容布局: {
                  宽度: 80,
                  文本行数: 2,
                },
              },
            ],
            衍生集合: [
              {
                填充颜色: 'rgba(81, 160, 255, 0.35)',
                内容布局: {
                  宽度: 60,
                  文本行数: 2,
                },
              },
            ],
          },
        },
        子集分离: {
          横向: {
            原始集合: [
              {
                填充颜色: 'none',
                内容布局: {
                  宽度: 120,
                  文本行数: 3,
                },
              },
              {
                填充颜色: 'rgba(81, 160, 255, 0.35)',
                内容布局: {
                  宽度: 50,
                  文本行数: 3,
                },
              },
              {
                填充颜色: 'rgba(81, 160, 255, 0.35)',
                内容布局: {
                  宽度: 50,
                  文本行数: 3,
                },
              },
            ],
          },
          纵向: {
            原始集合: [
              {
                填充颜色: 'none',
                内容布局: {
                  宽度: 50,
                  文本行数: 6,
                },
              },
              {
                填充颜色: 'rgba(81, 160, 255, 0.35)',
                内容布局: {
                  宽度: 50,
                  文本行数: 4,
                },
              },
              {
                填充颜色: 'rgba(81, 160, 255, 0.35)',
                内容布局: {
                  宽度: 50,
                  文本行数: 4,
                },
              },
            ],
          },
        },
      },
    },
    二层包含: {
      横向: {
        原始集合: [
          {
            填充颜色: 'none',
            内容布局: {
              宽度: 40,
              文本行数: 4,
            },
          },
          {
            填充颜色: 'rgba(81, 160, 255, 0.15)',
            内容布局: {
              宽度: 40,
              文本行数: 3,
            },
          },
          {
            填充颜色: 'rgba(81, 160, 255, 0.65)',
            内容布局: {
              宽度: 80,
              文本行数: 4,
            },
          },
        ],
      },
      纵向: {
        原始集合: [
          {
            填充颜色: 'none',
            内容布局: {
              宽度: 100,
              文本行数: 2,
            },
          },
          {
            填充颜色: 'rgba(81, 160, 255, 0.15)',
            内容布局: {
              宽度: 80,
              文本行数: 2,
            },
          },
          {
            填充颜色: 'rgba(81, 160, 255, 0.65)',
            内容布局: {
              宽度: 80,
              文本行数: 4,
            },
          },
        ],
      },
    },
    三层包含: {
      框架布局: {
        子图宽度: 280,
        定位: '48,19',
      },
      横向: {
        原始集合: [
          {
            填充颜色: 'none',
            内容布局: {
              宽度: 40,
              文本行数: 4,
            },
          },
          {
            填充颜色: 'rgba(81, 160, 255, 0.15)',
            内容布局: {
              宽度: 30,
              文本行数: 4,
            },
          },
          {
            填充颜色: 'rgba(81, 160, 255, 0.35)',
            内容布局: {
              宽度: 20,
              文本行数: 3,
            },
          },
          {
            填充颜色: 'rgba(81, 160, 255, 0.65)',
            内容布局: {
              宽度: 60,
              文本行数: 3,
            },
          },
        ],
      },
      纵向: {
        原始集合: [
          {
            填充颜色: 'none',
            内容布局: {
              宽度: 100,
              文本行数: 2,
            },
          },
          {
            填充颜色: 'rgba(81, 160, 255, 0.15)',
            内容布局: {
              宽度: 80,
              文本行数: 2,
            },
          },
          {
            填充颜色: 'rgba(81, 160, 255, 0.35)',
            内容布局: {
              宽度: 60,
              文本行数: 1,
            },
          },
          {
            填充颜色: 'rgba(81, 160, 255, 0.65)',
            内容布局: {
              宽度: 60,
              文本行数: 3,
            },
          },
        ],
      },
    },
    全集: {
      包含集: [
        {
          子图宽度: 220,
          定位: '77,60',
        },
      ],
      全集: {
        位置尺寸: '45,19,280,260',
        内容布局: {
          宽度: 50,
          文本行数: 3,
          文本位置: '0,0',
        },
        标签布局: {
          宽度: 50,
          文本行数: 3,
          文本位置: '0,0',
        },
        箭头布局: {
          文本位置: '0,0',
          连线位置: '0,0,100,100',
        },
      },
    },
    两个包含集: {
      框架布局: {
        字体大小: 12,
        包含集: [
          {
            子图宽度: 126,
            定位: '58,82',
          },
          {
            子图宽度: 126,
            定位: '193,83',
          },
        ],
      },
      一层包含: {
        单子集: {
          横向: {
            原始集合: [
              {
                填充颜色: 'none',
                内容布局: {
                  宽度: 60,
                  文本行数: 3,
                },
              },
              {
                填充颜色: 'rgba(81, 160, 255, 0.65)',
                内容布局: {
                  宽度: 40,
                  文本行数: 3,
                },
              },
            ],
          },
          纵向: {
            原始集合: [
              {
                填充颜色: 'none',
                内容布局: {
                  宽度: 60,
                  文本行数: 3,
                },
              },
              {
                填充颜色: 'rgba(81, 160, 255, 0.65)',
                内容布局: {
                  宽度: 40,
                  文本行数: 3,
                },
              },
            ],
          },
        },
        双子集: {
          子集相交: {
            横向: {
              原始集合: [
                {
                  填充颜色: 'none',
                  内容布局: {
                    宽度: 75,
                    文本行数: 1,
                  },
                },
                {
                  填充颜色: 'rgba(81, 160, 255, 0.15)',
                  内容布局: {
                    宽度: 40,
                    文本行数: 2,
                  },
                },
                {
                  填充颜色: 'rgba(81, 160, 255, 0.15)',
                  内容布局: {
                    宽度: 40,
                    文本行数: 2,
                  },
                },
              ],
              衍生集合: [
                {
                  填充颜色: 'rgba(81, 160, 255, 0.35)',
                  内容布局: {
                    宽度: 30,
                    文本行数: 2,
                  },
                },
              ],
            },
            纵向: {
              原始集合: [
                {
                  填充颜色: 'none',
                  内容布局: {
                    宽度: 20,
                    文本行数: 4,
                  },
                },
                {
                  填充颜色: 'rgba(81, 160, 255, 0.15)',
                  内容布局: {
                    宽度: 50,
                    文本行数: 2,
                  },
                },
                {
                  填充颜色: 'rgba(81, 160, 255, 0.15)',
                  内容布局: {
                    宽度: 50,
                    文本行数: 2,
                  },
                },
              ],
              衍生集合: [
                {
                  填充颜色: 'rgba(81, 160, 255, 0.35)',
                  内容布局: {
                    宽度: 50,
                    文本行数: 3,
                  },
                },
              ],
            },
          },
          子集分离: {
            横向: {
              原始集合: [
                {
                  填充颜色: 'none',
                  内容布局: {
                    宽度: 80,
                    文本行数: 1,
                  },
                },
                {
                  填充颜色: 'rgba(81, 160, 255, 0.35)',
                  内容布局: {
                    宽度: 40,
                    文本行数: 2,
                  },
                },
                {
                  填充颜色: 'rgba(81, 160, 255, 0.35)',
                  内容布局: {
                    宽度: 40,
                    文本行数: 2,
                  },
                },
              ],
            },
            纵向: {
              原始集合: [
                {
                  填充颜色: 'none',
                  内容布局: {
                    宽度: 30,
                    文本行数: 4,
                  },
                },
                {
                  填充颜色: 'rgba(81, 160, 255, 0.35)',
                  内容布局: {
                    宽度: 40,
                    文本行数: 2,
                  },
                },
                {
                  填充颜色: 'rgba(81, 160, 255, 0.35)',
                  内容布局: {
                    宽度: 40,
                    文本行数: 2,
                  },
                },
              ],
            },
          },
        },
      },
      二层包含: {
        横向: {
          原始集合: [
            {
              填充颜色: 'none',
              内容布局: {
                宽度: 20,
                文本行数: 4,
              },
            },
            {
              填充颜色: 'rgba(81, 160, 255, 0.15)',
              内容布局: {
                宽度: 20,
                文本行数: 3,
              },
            },
            {
              填充颜色: 'rgba(81, 160, 255, 0.65)',
              内容布局: {
                宽度: 50,
                文本行数: 3,
              },
            },
          ],
        },
        纵向: {
          原始集合: [
            {
              填充颜色: 'none',
              内容布局: {
                宽度: 60,
                文本行数: 1,
              },
            },
            {
              填充颜色: 'rgba(81, 160, 255, 0.15)',
              内容布局: {
                宽度: 50,
                文本行数: 1,
              },
            },
            {
              填充颜色: 'rgba(81, 160, 255, 0.65)',
              内容布局: {
                宽度: 50,
                文本行数: 3,
              },
            },
          ],
        },
      },
      三层包含: {
        横向: {},
        纵向: {},
      },
    },
  },
  相交集: {
    三相交: {
      子图宽度: 220,
      定位: '75,72',
      原始集合: [
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 56,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 56,
            文本行数: 3,
            文本位置: '144,258',
            文本定位: 'topCenter',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '39,194',
            文本定位: 'middleRight',
            文本对齐: 50,
            连线位置: '86,196,56,196',
          },
        },
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 56,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 56,
            文本行数: 3,
            文本位置: '224,258',
            文本定位: 'topCenter',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '325,195',
            文本定位: 'middleLeft',
            文本对齐: 50,
            连线位置: '284,196,314,196',
          },
        },
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 56,
            文本行数: 3,
            文本位置: '188,64',
            文本定位: 'bottomCenter',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '250,45',
            文本定位: 'bottomCenter',
            文本对齐: 50,
            连线位置: '250,116,250,48',
          },
        },
      ],
      衍生集合: [
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '146,63',
            文本定位: 'topLeft',
            文本对齐: 50,
            连线位置: '146,63,246,163',
          },
        },
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '70,42',
            文本定位: 'topLeft',
            文本对齐: 50,
            连线位置: '70,42,170,142',
          },
        },
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '97,186',
            文本定位: 'topLeft',
            文本对齐: 50,
            连线位置: '97,186,197,286',
          },
        },
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '30,299',
            文本定位: 'topLeft',
            文本对齐: 20,
            连线位置: '160,184,49,295',
          },
        },
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 36,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '340,301',
            文本定位: 'topRight',
            文本对齐: 60,
            连线位置: '215,209,303,297',
          },
        },
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '119,94',
            文本定位: 'bottomRight',
            文本对齐: 100,
            连线位置: '120,139,85,104',
          },
        },
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 2,
            文本位置: '262,103',
            文本定位: 'bottomLeft',
            文本对齐: 0,
            连线位置: '253,147,288,112',
          },
        },
      ],
    },
    二相交: {
      子图宽度: 220,
      定位: '77,56',
      原始集合: [
        {
          内容布局: {
            宽度: 56,
            文本行数: 5,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 56,
            文本行数: 1,
            文本位置: '147,43',
            文本定位: 'bottomCenter',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 2,
            文本位置: '37,116',
            文本定位: 'middleRight',
            文本对齐: 50,
            连线位置: '85,116,47,116',
          },
          填充颜色: 'none',
        },
        {
          内容布局: {
            宽度: 56,
            文本行数: 5,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 56,
            文本行数: 1,
            文本位置: '230,41',
            文本定位: 'bottomCenter',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '336,117',
            文本定位: 'middleLeft',
            文本对齐: 50,
            连线位置: '285,116,324,116',
          },
          填充颜色: 'none',
        },
      ],
      衍生集合: [
        {
          内容布局: {
            宽度: 56,
            文本行数: 4,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '185,210',
            文本定位: 'topCenter',
            文本对齐: 50,
            连线位置: '186,152,186,205',
          },
          填充颜色: 'none',
        },
      ],
    },
    全集: {
      三相交: {
        字体大小: 12,
        相交集: {
          子图宽度: 220,
          定位: '78,132',
          原始集合: [
            {
              内容布局: {
                宽度: 56,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 56,
                文本行数: 3,
                文本位置: '142,338',
                文本定位: 'topCenter',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 100,
                文本行数: 3,
                文本位置: '30,252',
                文本定位: 'middleRight',
                文本对齐: 50,
                连线位置: '85,252,36,252',
              },
            },
            {
              内容布局: {
                宽度: 56,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 90,
                文本行数: 2,
                文本位置: '223,337',
                文本定位: 'topCenter',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 100,
                文本行数: 3,
                文本位置: '343,252',
                文本定位: 'middleLeft',
                文本对齐: 50,
                连线位置: '292,253,340,253',
              },
            },
            {
              内容布局: {
                宽度: 100,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 90,
                文本行数: 2,
                文本位置: '189,104',
                文本定位: 'bottomCenter',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 100,
                文本行数: 2,
                文本位置: '237,51',
                文本定位: 'bottomCenter',
                文本对齐: 50,
                连线位置: '238,170,238,57',
              },
            },
          ],
          衍生集合: [
            {
              内容布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 100,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
                连线位置: '0,0,100,100',
              },
            },
            {
              内容布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 100,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
                连线位置: '0,0,100,100',
              },
            },
            {
              内容布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 100,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
                连线位置: '0,0,100,100',
              },
            },
            {
              内容布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 154,
                文本行数: 2,
                文本位置: '23,364',
                文本定位: 'topLeft',
                文本对齐: 10,
                连线位置: '161,240,41,360',
              },
            },
            {
              内容布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 36,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 154,
                文本行数: 2,
                文本位置: '348,363',
                文本定位: 'topRight',
                文本对齐: 70,
                连线位置: '211,273,299,361',
              },
            },
            {
              内容布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 100,
                文本行数: 2,
                文本位置: '20,112',
                文本定位: 'bottomLeft',
                文本对齐: 50,
                连线位置: '123,210,36,124',
              },
            },
            {
              内容布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 50,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 100,
                文本行数: 2,
                文本位置: '351,112',
                文本定位: 'bottomRight',
                文本对齐: 50,
                连线位置: '252,219,347,123',
              },
            },
          ],
        },
        全集: {
          位置尺寸: '48,117,280,210',
          内容布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '64,138',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 100,
            文本行数: 1,
            文本位置: '134,38',
            文本定位: 'bottomCenter',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
            连线位置: '0,0,100,100',
          },
        },
      },
      二相交: {
        字体大小: 12,
        相交集: {
          子图宽度: 220,
          定位: '79,101',
          原始集合: [
            {
              内容布局: {
                宽度: 56,
                文本行数: 5,
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 56,
                文本行数: 1,
                文本位置: '138,246',
                文本定位: 'topCenter',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 100,
                文本行数: 3,
                文本位置: '26,161',
                文本定位: 'middleRight',
                文本对齐: 50,
                连线位置: '83,160,34,160',
              },
              填充颜色: 'none',
            },
            {
              内容布局: {
                宽度: 56,
                文本行数: 5,
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 56,
                文本行数: 1,
                文本位置: '229,246',
                文本定位: 'topCenter',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 100,
                文本行数: 3,
                文本位置: '347,160',
                文本定位: 'middleLeft',
                文本对齐: 50,
                连线位置: '291,160,339,160',
              },
              填充颜色: 'none',
            },
          ],
          衍生集合: [
            {
              内容布局: {
                宽度: 56,
                文本行数: 4,
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              标签布局: {
                宽度: 100,
                文本行数: 3,
                文本位置: '0,0',
                文本定位: 'topLeft',
                文本对齐: 50,
              },
              箭头布局: {
                宽度: 100,
                文本行数: 3,
                文本位置: '186,268',
                文本定位: 'topCenter',
                文本对齐: 50,
                连线位置: '187,201,187,254',
              },
              填充颜色: 'none',
            },
          ],
        },
        全集: {
          位置尺寸: '46,27,280,210',
          内容布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '53,70',
            文本定位: 'topLeft',
            文本对齐: 50,
          },
          标签布局: {
            宽度: 100,
            文本行数: 2,
            文本位置: '50,46',
            文本定位: 'bottomLeft',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 100,
            文本行数: 1,
            文本位置: '187,32',
            文本定位: 'bottomCenter',
            文本对齐: 50,
            连线位置: '187,68,187,42',
          },
        },
      },
    },
  },
  离散集: {
    单集: {
      子图宽度: 300,
      定位: '78,77',
      原始集合: [
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 180,
            文本行数: 7,
          },
          标签布局: {
            宽度: 220,
            文本行数: 1,
            文本位置: '187,52',
            文本定位: 'topCenter',
            文本对齐: 50,
          },
          箭头布局: {
            宽度: 50,
            文本行数: 3,
            文本位置: '0,0',
            文本定位: 'topLeft',
            文本对齐: 50,
            连线位置: '0,0,100,100',
          },
        },
      ],
    },
    多集: {
      子图宽度: 280,
      定位: '57,21',
      原始集合: [
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 94,
            文本行数: 4,
          },
          标签布局: {
            宽度: 94,
            文本行数: 1,
            文本定位: 'topLeft',
            文本对齐: 50,
          },
        },
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 94,
            文本行数: 4,
          },
          标签布局: {
            宽度: 94,
            文本行数: 1,
            文本定位: 'topLeft',
            文本对齐: 50,
          },
        },
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 94,
            文本行数: 4,
          },
          标签布局: {
            宽度: 94,
            文本行数: 1,
            文本定位: 'topLeft',
            文本对齐: 50,
          },
        },
        {
          填充颜色: 'none',
          内容布局: {
            宽度: 94,
            文本行数: 4,
          },
          标签布局: {
            宽度: 94,
            文本行数: 1,
            文本定位: 'topLeft',
            文本对齐: 50,
          },
        },
      ],
    },
    全集: {
      字体大小: 12,
      离散集: {
        子图宽度: 300,
        定位: '173,115',
        原始集合: [
          {
            填充颜色: 'none',
            内容布局: {
              宽度: 60,
              文本行数: 4,
            },
            标签布局: {
              宽度: 100,
              文本行数: 1,
              文本位置: '176,244',
              文本定位: 'topLeft',
              文本对齐: 50,
            },
            箭头布局: {
              宽度: 50,
              文本行数: 3,
              文本位置: '340,156',
              文本定位: 'middleRight',
              文本对齐: 50,
              连线位置: '278,156,324,156',
            },
          },
        ],
      },
      全集: {
        位置尺寸: '79,76,220,160',
        内容布局: {
          宽度: 80,
          文本行数: 6,
          文本位置: '95,155',
          文本定位: 'middleLeft',
          文本对齐: 0,
        },
        标签布局: {
          宽度: 100,
          文本行数: 1,
          文本位置: '91,52',
          文本定位: 'topLeft',
          文本对齐: 0,
        },
        箭头布局: {
          宽度: 200,
          文本行数: 1,
          文本位置: '188,28',
          文本定位: 'topCenter',
          文本对齐: 50,
          连线位置: '189,98,188,50',
        },
      },
    },
  },
};
